export const footerBottomData = [
    {
        id:"111",
        text:"Покупателям",
        links: [
            {
                id:"1110",
                text:"Каталог товаров",
                link:"/",
            },
            {
                id:"1111",
                text:"Как сделать заказ",
                link:"/",
            },
            {
                id:"1112",
                text:"Способы оплаты",
                link:"/",
            },
            {
                id:"1113",
                text:"Доставка",
                link:"/",
            },
            {
                id:"1114",
                text:"Возврат товара",
                link:"/",
            },
            {
                id:"1115",
                text:"Возврат денежных средств",
                link:"/",
            },
            {
                id:"1116",
                text:"Правила пользования площадкой",
                link:"/",
            },
            {
                id:"1117",
                text:"Вопросы и ответы",
                link:"/",
            },
        ],
    },
    {
        id:"112",
        text:"Партнерам",
        links: [
            {
                id:"1121",
                text:"Продавайте на OptQuick",
                link:"/",
            },
            {
                id:"1122",
                text:"Обратная связь",
                link:"/feedback",
            },
            {
                id:"1123",
                text:"Контакты разработчиков",
                link:"/",
            },
            {
                id:"1124",
                text:"О проекте",
                link:"/",
            },
            {
                id:"1125",
                text:"Поддержать проект",
                link:"/",
            },
        ],
    },
    {
        id:"113",
        text:"Наши проекты",
        links: [
            {
                id:"1131",
                text:"cryptoQuick.ru",
                link:"/",
            },
            {
                id:"1132",
                text:"kdubasov",
                link:"/",
            },
            {
                id:"1133",
                text:"mihael",
                link:"/",
            },
        ],
    },
    {
        id:"114",
        text:"Компания",
        links: [
            {
                id:"1141",
                text:"О нас",
                link:"/",
            },
            {
                id:"1142",
                text:"Статьи",
                link:"/",
            },
            {
                id:"1143",
                text:"Контакты",
                link:"/",
            },
            {
                id:"1144",
                text:"Сотрудничество",
                link:"/",
            },
        ],
    },
];
