export const BenefitsCardsData = [
    {
        id: "bc0001",
        color: "#67DA97",
        title: "Удобный поиск",
        text: "Найти необходимые товары очень просто, благодаря системе поиска или списка категорий.",
    },
    {
        id: "bc0002",
        color: "#A16BF7",
        title: "Живые отзывы",
        text: "Все отзывы, представленные на площадке – от настоящих покупателей.",
    },
    {
        id: "bc0003",
        color: "#74C9FA",
        title: "Без посредников",
        text: "Никаких третьих лиц. Вы напрямую связываетесь с поставщиком и обговариваете условия сделки.",
    },
    {
        id: "bc0004",
        color: "#ED734B",
        title: "Простая регистрация",
        text: "Для регистрации на площадке нужен только телефон и две минуты свободного времени.",
    },
];