import React from 'react';
import "./WebsiteRulesPage.css";
import {Container} from "react-bootstrap";

const WebsiteRulesPage = () => {
    return (
        <Container className={"WebsiteRulesPage"}>
            <h3 className="title">Правила пользования площадкой</h3>

            <h5 className={"mt-3"}>Термины и определения</h5>
            <h6>
                1. В настоящих Правилах, если контекст не требует много,
                нижеприведенные термины имеют следующие значения и
                являются их составной неотъемлемой частью:
                <br/><br/>
                <b>Торговая площадка</b> – веб-сайт <b>https://www.optquick.ru</b>,
                являющееся сервисом, предоставляющим доступ к информации
                о товарах и поставщиках, предназначенной для
                потенциальных Покупателей (потребителей).
                <br/><br/>
                <b>Владелец Торговой площадки</b> – ИП “Воробушков Михаил”, ИП “Дубасов Кирилл”
                <br/><br/>
                <b>Покупатель</b> – любое физическое лицо, использующее
                Торговую площадку на условиях настоящих Правил.
                <br/><br/>
                <b>Продавец</b> – индивидуальный предприниматель, юридическое лицо или самозанятый
                гражданин, осуществляющие деятельность по продаже товаров и предлагающие
                Покупателю заключить договор купли-продажи Товара, размещая Товары
                на Торговой площадке.
                <br/><br/>
                <b>Товар</b> – предмет договора купли-продажи, заключаемого между Покупателем и Продавцом.
                Продавец является собственником реализуемого Товара. Все взаимоотношения, связанные
                с куплей-продажей Товара возникают между Продавцом, размещающим Товар на
                Торговой площадке и Покупателем.
                <br/><br/>
                <b>Личный кабинет</b> – персональный и не доступный третьим лицам раздел Торговой площадки,
                служащий в целях оформления Заказов и оформления Услуг, а также получения специальных
                предложений в соответствии с настоящими Правилами, доступ к которому осуществляется
                после регистрации путем ввода аутентификационных данных Покупателя.
                <br/><br/>
                <b>Акционная скидка</b> – это скидка, которая предоставляется на определенный Товар.
                Размер скидки указывается на странице Товара. Цена на Товар указана с учетом акционной скидки.
                <br/><br/>
                <b>Скидка по промокоду</b> – это скидка, которая предоставляется на определенную
                группу Товаров/Товара при оформлении Покупателем Заказа.
                <br/><br/>
                <b>Промокод</b> – это специальный код, который предоставляет скидку на определенную группу
                Товаров/Товар и имеет срок действия. Промокоды применяются автоматически.
                К одной единице Товара может быть применен только один промокод.
            </h6>

            <h5>Общие положения</h5>
            <h6>
                1. Пользуясь Торговой площадкой, Покупатель соглашается с условиями настоящих Правил.
                <br/>
                2. Торговая площадка предоставляет Покупателю безвозмездную возможность поиска
                информации о Товарах, Продавцах, ознакомления с товарными предложениями Продавцов,
                возможность получения (в т.ч. по результатам поиска) товарных предложений и информации,
                а также иные функциональные возможности.
                <br/>
                3. Торговая площадка “Optquick” вправе самостоятельно и без уведомления Покупателя отбирать
                отзывы для публикации, в том числе:
                <br/>
                <ul>
                    <li>
                        - оставлять отзывы о Товарах, размещенных на Торговой площадке, ставить оценки Товарам
                        при использовании Торговой площадки может любой авторизованный Покупатель;
                    </li>
                    <li>
                        - вместе с отзывом Покупателя будет опубликовано его имя, указанное
                        им в Личном кабинете Торговой площадки;
                    </li>
                    <li>
                        - не публиковать отзывы, содержание которых не относится к тематике
                        работы Торговой площадки, осуществлению покупок на ней;
                    </li>
                    <li>
                        - не публиковать отзывы, содержание которых не относится к тематике работы
                        Торговой площадки, осуществлению покупок на ней;
                    </li>
                    <li>
                        - не публиковать отзывы, содержание которых не относится к реальному опыту
                        использования соответствующего товара;
                    </li>
                    <li>
                        - не публиковать отзывы, которые содержат ненормативную лексику,
                        высказывания оскорбительного характера, в том числе фотографии и изображения,
                        недопустимые к публикации с этической точки зрения;
                    </li>
                    <li>
                        - не публиковать отзывы, комментарии, содержащие ссылки на другие веб-сайты,
                        персональные данные третьих лиц;
                    </li>
                    <li>- удалить опубликованный отзыв в любое время;</li>
                    <li>
                        - самостоятельно определять срок, в течение которого отзывы считаются актуальными
                        и на который они публикуются на Торговой площадке.
                    </li>
                </ul>
                <br/>
                <h6>
                    4. Покупатель соглашается с тем, что размещенные им на Торговой площадке сообщения и
                    материалы могут быть использованы “Optquick”, в том числе в иных сервисах и приложениях
                    “Optquick”, в рекламных или маркетинговых материалах, размещаемых на ресурсах “Optquick”
                    в сети Интернет, а также на иных ресурсах и сайтах в сети Интернет, для привлечения
                    внимания других потребителей к Торговой площадке в целом или к товарам и услугам
                    третьих лиц, как с указанием автора сообщения или материала (в качестве имени автора
                    при этом будет указываться имя Покупателя, которое он указал при регистрации или в
                    настройках своих данных в Личном кабинете), так и без этого, без обязанности предоставлять
                    отчеты об использовании таких сообщений и материалов, без необходимости получения
                    специального разрешения Покупателя и без выплаты авторского вознаграждения, на территории
                    всего мира без ограничения срока, с правом “Optquick” предоставлять указанные права
                    использования таких сообщений и материалов третьим лицам.
                    <br/><br/>
                    5. Покупатель соглашается, что оставленные им отзывы и поставленные оценки могут быть
                    опубликованы и использованы “Optquick” на Торговой площадке или на сайтах третьих лиц
                    без дополнительного согласия Покупателя. При этом отзывы и приложенные к нему изображения
                    публикуются и используются «как есть» с сохранением авторской грамматики и пунктуации,
                    под именем Покупателя, указанным в Личном кабинете. Покупатель несет ответственность
                    за достоверность сведений, содержащихся в оставленных им отзывах.
                    <br/><br/>
                    6. Покупатель соглашается, что оставленные им отзывы и поставленные оценки могут быть
                    опубликованы и использованы “Optquick” на Торговой площадке или на сайтах третьих лиц
                    без дополнительного согласия Покупателя. При этом отзывы и приложенные к нему изображения
                    публикуются и используются «как есть» с сохранением авторской грамматики и пунктуации,
                    под именем Покупателя, указанным в Личном кабинете. Покупатель несет ответственность за
                    достоверность сведений, содержащихся в оставленных им отзывах.
                </h6>

                <h5>Регистрация на сайте</h5>
                <h6>
                    1. Оформить Заказ/связаться с Продавцом на Торговой площадке могут только зарегистрированные
                    Покупатели, при этом Покупатель вправе зарегистрироваться на сайте только 1 (один) раз,
                    т.е. может иметь только один Личный кабинет.
                    <br/>
                    2. “Optquick” не несет ответственности за точность и правильность информации, предоставляемой
                    Покупателем при регистрации.
                    <br/>
                    3. Покупатель, зарегистрировавшийся на Торговой площадке, получает индивидуальную
                    идентификацию путем ввода смс с кодом доступа, направленного “Optquick” на указанный
                    в Личном кабинете контактный номер. Индивидуальная идентификация Покупателя
                    позволяет избежать несанкционированных действий третьих лиц от имени Покупателя
                    и открывает доступ к дополнительным сервисам. Передача Покупателем кода доступа
                    третьим лицам запрещена.
                    <br/>
                    4. Покупатель несёт ответственность за все возможные негативные последствия,
                    в случае передачи кода доступа, а также учетных данных Личного кабинета третьим лицам.
                </h6>

                <h5>Права и обязанности сторон</h5>
                <h6>
                    <b>“Optquick” обязуется:</b>
                    <br/><br/>
                    1. Обрабатывать персональные данные Покупателя в порядке, установленном действующим
                    законодательством и Политикой “Optquick” в отношении организации обработки и обеспечения
                    безопасности персональных данных.
                    <br/>
                    2. Обрабатывать персональные данные Покупателя в порядке, установленном действующим
                    законодательством и Политикой “Optquick” в отношении организации обработки и обеспечения
                    безопасности персональных данных.
                    <br/>
                    3. В случае достижения цели обработки персональных данных Покупателя, “Optquick”
                    обязуется прекратить обработку персональных данных или обеспечить ее прекращение
                    (если обработка персональных данных осуществляется другим лицом, действующим по
                    поручению “Optquick”) и уничтожить персональные данные или обеспечить их уничтожение
                    (если обработка персональных данных осуществляется другим лицом, действующим по
                    поручению “Optquick”) в срок, не превышающий тридцати дней с даты достижения
                    цели обработки персональных данных, если иное не предусмотрено договором,
                    стороной которого, выгодоприобретателем или поручителем по которому является
                    Покупатель, иным соглашением между “Optquick” и Покупателем.
                    <br/>
                    4. В случае отзыва Покупателем согласия на обработку его персональных данных
                    “Optquick” обязуется прекратить их обработку или обеспечить прекращение такой
                    обработки (если обработка персональных данных осуществляется другим лицом,
                    действующим по поручению “Optquick”) и в случае, если сохранение персональных
                    данных более не требуется для целей обработки персональных данных, уничтожить
                    персональные данные или обеспечить их уничтожение (если обработка персональных
                    данных осуществляется другим лицом, действующим по поручению “Optquick”) в срок,
                    не превышающий тридцати дней с даты поступления указанного отзыва, если иное не
                    предусмотрено договором, стороной которого, выгодоприобретателем или поручителем
                    по которому является Покупатель.
                    <br/><br/>

                    <b>“Optquick” имеет право:</b>
                    <br/><br/>
                    1. Изменять настоящие Правила в одностороннем порядке, помещая их на Торговой площадке,
                    расположенной по интернет-адресу: https://www.optquick.ru. Все изменения вступают в
                    силу немедленно после публикации, и считаются доведенными до сведения Покупателя с
                    момента такой публикации.
                    <br/>
                    2. Осуществлять записи телефонных переговоров с Покупателем. В соответствии с пунктом
                    4 статьи 16 Федерального закона от 27.07.2006 № 149-ФЗ «Об информации, информационных
                    технологиях и о защите информации» “Optquick” обязуется: предотвращать попытки
                    несанкционированного доступа к информации и/или передачу ее лицам, не имеющим
                    непосредственного отношения к исполнению Заказов, своевременно обнаруживать и
                    пресекать такие факты.
                    <br/>
                    3. Без согласования с Покупателем передавать свои права и обязанности по исполнению
                    обязательств перед Покупателем третьим лицам.
                    <br/>
                    4. “Optquick” имеет право потребовать от Покупателя 100% предоплаты заказанного Товара.
                    “Optquick” имеет право отказать Покупателю в оформлении Заказа и доставке
                    Товара при отсутствии такой оплаты.
                    <br/>
                    5. Отменить Заказ с безналичным способом оплаты по истечении 10 минут с момента
                    оформления, в случае не поступления оплаты.
                    <br/>
                    6. Ограничить количество одновременно доставляемого Покупателю Товара.
                    <br/>
                    7. Использовать технологию «cookies». «Cookies» не содержат конфиденциальную информацию
                    и не передаются третьим лицам.
                    <br/>
                    8. Получать информацию об ip-адресе посетителя веб-сайта www.optquick.ru.
                    Данная информация не используется для установления личности посетителя
                    и не подлежит передаче третьим лицам.
                    <br/>
                    9. Направлять Покупателю сообщения рекламно-информационного характера посредством
                    e-mail и sms-рассылок с информацией о скидках, акциях, новых поступлениях
                    и т.п. Частота рассылок определяется “Optquick” самостоятельно, в одностороннем порядке.
                    <br/>
                    10. В одностороннем порядке отменить Заказ Покупателя в случае нарушения Покупателем
                    пункта 3.3. настоящего раздела Правил.
                    <br/>
                    11. Произвести ограничения по сумме заказываемых Товаров на один день доставки.
                    <br/>
                    12. Изменять условия Акций, размещённых на сайте Торговой площадки www.optquick.ru,
                    в одностороннем порядке без согласия Покупателя, путём размещения таких изменений
                    на сайте Торговой площадки www.optquick.ru.
                    <br/>
                    13. При доставке предоплаченного Заказа потребовать у Покупателя код для получения
                    Заказа, отраженный в личном кабинете Покупателя. При непредъявлении Покупателем
                    указанного кода отказать Покупателю в выдаче Товара.
                    <br/>
                    14. Отзыв настоящих Правил может быть осуществлён “Optquick”
                    <br/>
                    15. в любое время, но это не является основанием для отказа от обязательств
                    “Optquick” и иных Продавцов, размещающих Товары на Торговой площадке,
                    по уже заключённым договорам.
                    <br/><br/><br/>

                    <b>Покупатель обязуется:</b>
                    <br/><br/>
                    До момента заключения Договора ознакомиться с содержанием и условиями настоящих Правил,
                    ценами на Товары, предлагаемыми на Торговой площадке, а также с порядком и условиями
                    оказания “Optquick” услуги доставки Товара.
                    <br/><br/><br/><br/>

                    <b>Покупатель вправе:</b>
                    <br/><br/>
                    Покупатель вправе отказаться от получения e-mail и sms-рассылок, для этого ему нужно
                    нажать на ссылку в письме «Вы можете отписаться от рассылки из своего Личного
                    кабинета» или зайти на страницу «Подписки» в Личном кабинете.
                </h6>

                <h5>Заключительные положения</h5>
                <h6>
                    1. Настоящее Пользовательское соглашение вступает в силу с момента начала пользования
                    Пользователем Сервисами Сайта, независимо от факта Регистрации Пользователя или
                    размещения Объявления, и действует бессрочно.
                    <br/>
                    2. При разрешении всех споров по настоящему Пользовательскому соглашению применяется
                    действующее законодательство Российской Федерации.
                    <br/>
                    3. Ввиду безвозмездности использования Сервисов, предоставляемых Пользователю в
                    рамках настоящего Пользовательского соглашения, положения законодательства о
                    защите прав потребителей не подлежат применению к отношениям между
                    Пользователем и Провайдером.
                    <br/>
                    4. Признание отдельных частей настоящего Пользовательского соглашения недействительными
                    не отменяет действие других положений настоящего Пользовательского соглашения.
                </h6>
            </h6>
        </Container>
    );
};

export default WebsiteRulesPage;
